#+STARTUP: overview
#+HTML_HEAD: <style type="text/css">body{ max-width:50%; }</style>
#+OPTIONS: \n:t
* ChIP protocol
Reagents needed
| Buffer   | Volume/sample (mL) | # samples | total volume (mL) |
|----------+--------------------+-----------+-------------------|
| Glycine  |                  1 |       4.5 |               4.5 |
| 1x PBS   |                 20 |           |               90. |
| lysis    |                0.5 |           |              2.25 |
| Dilution |                3.8 |           |              17.1 |
#+TBLFM: @2$4=$2*@2$3::@3$4=$2*@2$3::@4$4=$2*@2$3::@5$4=$2*@2$3
** Buffer preparations
   Note 1: all buffers should be sterile filtered and good for 2 weeks at
   4 degree protected from light
   1. EDTA buffer (30 mL per mouse)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |             5. |
| KCl         |             5 |              2 |            0.5 |
| NaH2PO4     |           0.5 |            0.5 |            0.2 |
| HEPES       |            10 |              1 |              2 |
| EDTA        |             5 |            0.5 |             2. |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |         360.32 |
| BDM         |            10 |         101.11 |         202.22 |
| Taurine     |            10 |         125.15 |          250.3 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           200 |            H2O |          189.3 |
| Ph to 7.8   |        approx |        1N NaOH |              1 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200

   2. Perfusion buffer (90 mL per mouse, accounting for Col and STOP)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |            10. |
| KCl         |             5 |              2 |              1 |
| NaH2PO4     |           0.5 |            0.5 |            0.4 |
| HEPES       |            10 |              1 |              4 |
| MgCl2       |             1 |              1 |            0.4 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |         720.64 |
| BDM         |            10 |         101.11 |         404.44 |
| Taurine     |            10 |         125.15 |          500.6 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           400 |            H2O |          382.2 |
| Ph to 7.8   |        approx |        1N NaOH |              2 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200
   3. Collagenase buffer (60 mL per mouse) in perfusion buffer
      Prepare right before procedure, warm to 37 degree
| Component     | TargConc (mg/mL) | Weight (mg)    |
|---------------+------------------+----------------|
| Collagenase 2 |              0.5 |           125. |
| Collagenase 4 |              0.5 |           125. |
| Protease XIV  |             0.05 |           12.5 |
| Volume (mL)   |              250 |                |
#+TBLFM: @2$3=$2 * @5$2::@3$3=$2 * @5$2::@4$3=$2 * @5$2
   4. Stop buffer (10 mL per mouse)
| Component             | TargConc (%) | volumn |
|-----------------------+--------------+--------|
| FBS                   |            5 |      2 |
| perfusion Buffer (mL) |           40 |     38 |
#+TBLFM: @2$3=@2$2*@3$2/100::@3$3=@3$2 - @2$3
** Buffer preparations
   Note 1: all buffers should be sterile filtered and good for 2 weeks at
   4 degree protected from light
   1. EDTA buffer (20 mL per mouse)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |           3.75 |
| KCl         |             5 |              2 |          0.375 |
| NaH2PO4     |           0.5 |            0.5 |           0.15 |
| HEPES       |            10 |              1 |            1.5 |
| EDTA        |             5 |            0.5 |            1.5 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |         270.24 |
| BDM         |            10 |         101.11 |        151.665 |
| Taurine     |            10 |         125.15 |        187.725 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           150 |            H2O |        141.975 |
| Ph to 7.8   |        approx |        1N NaOH |           0.75 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200

   2. Perfusion buffer (20 mL per mouse, accounting for Col and STOP)
| Component   | TargConc (mM) | Stock Conc (M) | Stock Vol (mL) |
|-------------+---------------+----------------+----------------|
| NaCl        |           113 |           4.52 |           3.75 |
| KCl         |             5 |              2 |          0.375 |
| NaH2PO4     |           0.5 |            0.5 |           0.15 |
| HEPES       |            10 |              1 |            1.5 |
| MgCl2       |             1 |              1 |           0.15 |
|-------------+---------------+----------------+----------------|
| Component   | TargConc (mM) |             MW |    Weight (mg) |
|-------------+---------------+----------------+----------------|
| Glucose     |            10 |         180.16 |         270.24 |
| BDM         |            10 |         101.11 |        151.665 |
| Taurine     |            10 |         125.15 |        187.725 |
|-------------+---------------+----------------+----------------|
| TargVol(mL) |           150 |            H2O |        143.325 |
| Ph to 7.8   |        approx |        1N NaOH |           0.75 |
#+TBLFM: $4=@11$2 - vsum(@2..@6) - @12$4::@2$4=(@11$2*@2$2)/(@2$3*1000)::@3$4=(@11$2*@3$2)/(@3$3*1000)::@4$4=(@11$2*@4$2)/(@4$3*1000)::@5$4=(@11$2*@5$2)/(@5$3*1000)::@6$4=(@11$2*@6$2)/(@6$3*1000)::@8$4=(@11$2 / 1000) * @8$2 * @8$3::@9$4=(@11$2 / 1000) * @9$2 * @9$3::@10$4=(@11$2 / 1000) * @10$2 * @10$3::@12$4=@11$2/200
   3. Collagenase buffer (10 mL per mouse) in perfusion buffer
      Prepare right before procedure, warm to 37 degree
| Component                | TargConc (mg/mL) | Weight (mg) |
|--------------------------+------------------+-------------|
| Collagenase 2            |              3.2 |       147.2 |
| Soybean Trysin Inhibitor |              0.2 |         9.2 |
| Elastase suspension (uL) |             0.75 |   1337.2093 |
| Volume (mL)              |               46 |             |
#+TBLFM: @2$3=$2 * @5$2::@3$3=$2 * @5$2::@4$3=(($2 * @5$2) / 25.8) * 1000
   4. Stop buffer (5 mL per mouse)
| Component             | TargConc (%) | volumn |
|-----------------------+--------------+--------|
| FBS                   |            5 |      1 |
| perfusion Buffer (mL) |           20 |     19 |
#+TBLFM: @2$3=@2$2*@3$2/100::@3$3=@3$2 - @2$3
** 293
   24 well plate
|    well |  6.5 |           |
|---------+------+-----------|
| Plasmid | DMEM | turbofect |
|---------+------+-----------|
|    1.07 |  100 |         2 |
|   6.955 | 650. |       13. |
#+TBLFM: @4$1=@1$2*@3$1::@4$2=@1$2*@3$2::@4$3=@1$2*@3$3
protein related analysis done 48 hours post, RNA related can be done 24 post
